Revit 2027 API
BuiltInFailures.GeneralFailures.ValueOutOfRange Property
 Value is out of range ! Please enter a number between [Value] and [Value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ValueOutOfRange { get; }
Public Shared ReadOnly Property ValueOutOfRange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ValueOutOfRange {
	FailureDefinitionId^ get ();
}
static member ValueOutOfRange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace